# ShowLayer

## Description
Procedure ShowLayer sets the visibility status of the active layer to visible. Newly created layers always defaulted to the Show mode.

```pascal
PROCEDURE ShowLayer;
```

```python
def vs.ShowLayer():
    return None
```

## Examples
==== VectorScript ====
```pascal
Layer('Future Construction');
ShowLayer;
```
==== Python ====
```python

```

## Version
Availability: from All Versions

## Category
* Layers